<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2023, Sections 002
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 1, Part 2<br>Introduction to Core Concepts, ER Modeling, Relational Algebra, SQL<br>
    
</span>
</center></i>

# Introduction and Overview

## HW Objectives

- HW 1 part 1 covered general topics and knowledge from the class material. Part 2 has practical exercises.


- The notebook contains core practical exercises for both tracks (Programming, Non-Programming). All students complete this section.


- There are not track specific assignments for this HW.

## Submission Instructions

Complete all the tests in this notebook and submit only this notebook as a PDF to GradeScope. To convert the jupyter notebook into a pdf you can use either of the following methods:

- File --> Print Preview --> Print --> Save to PDF 

- File --> Download As HTML --> Print --> Save to PDF


__Due date: February 12, 11:59 PM EDT on GradeScope__



It is recommended that you put the screenshots into the same folder as this notebook so you do not have to alter the path to include your images. 


Please read all the instructions thoroughly!

## Guidelines

You may not work with or collaborate with anyone in any way to complete the homework. You may speak with the professor and TAs. You may ask __private__ questions on Ed if you need clarification.


You may use lecture slides, the textbook slides, the textbook or public information on the web to help you answer your questions. You may not "cut and past" information. Your answer must be in your own words and demonstrate the you understand the concept. If you use information for sources other than lectures, lecture slides, textbook slides or the textbook, you MUST provide a URL to the source you used.

## Add Student Information

1. Replace my name with your full name.
2. Replace my UNI with your UNI.
3. Replace "Cool Track" with either "Programming" or "Non-programming."

In [74]:
# Print your name, uni, and track below

name = "Ly Na Nguyen"
uni = "lhn2112"
track = "Programming Track"

print(name)
print(uni)
print(track)

Ly Na Nguyen
lhn2112
Programming Track

# Testing Environment

Run the following cells to ensure that your environment is set up.


You may need to change passwords.

## General Packages

In [75]:
import json

In [76]:
import csv

In [77]:
import pandas

In [78]:
import os

## pymysql

In [79]:
import pymysql

In [80]:
#
# Run this cell but change your user ID and password.
#
pymysql_conn = pymysql.connect(
    user="root",
    password="dbuserdbuser",
    host="localhost",
    port=3306,
    autocommit=True,
    cursorclass=pymysql.cursors.DictCursor
)

In [81]:
cursor = pymysql_conn.cursor()
sql = "show databases"
res = cursor.execute(sql)
databases = cursor.fetchall()

In [82]:
#
# Your list of databases will be different.
# You are fine as long as you do not get an error.
#
databases

[{'Database': 'db_book'},
 {'Database': 'information_schema'},
 {'Database': 'lahmanshw1'},
 {'Database': 'mysql'},
 {'Database': 'performance_schema'},
 {'Database': 'sys'},
 {'Database': 'W4111_HW1'}]

## ipython-SQL

In [83]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [84]:
#
# Remember to change your user ID and password.
#
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [85]:
%sql select * from db_book.student where ID=12345

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('12345', 'Shankar', 'Comp. Sci.', Decimal('32'))]

## SQLAlchemy

In [86]:
from sqlalchemy import create_engine

In [87]:
#
# Remember to change your user ID and password.
#
sql_url = "mysql+pymysql://root:dbuserdbuser@localhost"

In [88]:
engine = create_engine(sql_url)

In [89]:
sql = "select * from db_book.student"
df = pandas.read_sql(sql, con=engine)

In [90]:
df

       ID      name   dept_name  tot_cred
0   00128     Zhang  Comp. Sci.     102.0
1   12345   Shankar  Comp. Sci.      32.0
2   19991    Brandt     History      80.0
3   23121    Chavez     Finance     110.0
4   44553   Peltier     Physics      56.0
5   45678      Levy     Physics      46.0
6   54321  Williams  Comp. Sci.      54.0
7   55739   Sanchez       Music      38.0
8   70557      Snow     Physics       0.0
9   76543     Brown  Comp. Sci.      58.0
10  76653       Aoi  Elec. Eng.      60.0
11  98765  Bourikas  Elec. Eng.      98.0
12  98988    Tanaka     Biology     120.0

# Common Exercises

## Loading Data

- If you are running the notebook in the folder that you cloned/downloaded, there are files in the ```data``` directory.

In [91]:
!ls data

Appearances.csv                       course_feed.json
Batting.csv                           course_info.json
Managers.csv                          departments.csv
People.csv                            evalkit_eval_courses_instructors.json
Pitching.csv                          evalkit_eval_instructors.json
Teams.csv                             instructors.json
characters-groups.csv                 scenes.csv
characters.csv                        tmp.py

In [92]:
data_dir = "data/"
csv_files = [
    "People.csv",
    "Appearances.csv",
    "Batting.csv",
    "Pitching.csv",
    "Teams.csv",
    "Managers.csv"
]

- Use ```%sql``` to create a databases schema ```lahmanshw1```.

In [93]:
#
# Answer
#
%sql create schema lahmanshw1

 * mysql+pymysql://root:***@localhost
(pymysql.err.ProgrammingError) (1007, "Can't create database 'lahmanshw1'; database exists")
[SQL: create schema lahmanshw1]
(Background on this error at: https://sqlalche.me/e/14/f405)

- The class lecture showed how to load a CSV file in Pandas and save to a database.


- Load and save the CSV files. You should implement the function and then call in the following cells.

In [107]:
def load_and_save_csv(data_dir:str, file_name:str, schema:str, table_name:str=None):
    """
    
    :param data_dir: The directory containing the file.
    :param file_name: The file name.
    :param schema: The database for the saved table.
    :param table_name: The name of the table to create. If the name is None, the function uses the name of
        the file before '.csv'. So, file_name 'cat.csv' becomes table 'cat'.
    :return: None
    """
    
    if table_name is None:
        table_name = file_name.split(".")
        table_name = table_name[0]
        
    full_file_name = os.path.join(data_dir, file_name)
    
    #
    # TODO: Remove answer and have your code goes here.
    #
    df = pandas.read_csv(full_file_name)
    df.to_sql(table_name, con=engine, schema=schema, if_exists='replace', index=False)

In [108]:
for f in csv_files:
    load_and_save_csv(data_dir, f, "lahmanshw1")
    print("Saved file:", f)

InvalidRequestError: Could not reflect: requested table(s) not available in Engine(mysql+pymysql://root:***@localhost) schema 'lahmanshw1': (People)

In [109]:
#
# The following should get the create table statements for the tables
# you created above.
#
# This code is here just because I was bored.
#
tables = %sql show tables from lahmanshw1
table_names = [t[0] for t in tables]
table_names

all_tables = ""

%sql use lahmanshw1

for t in table_names:
    sql = "show create table " + t
    tmp = %sql $sql 
    tmp = tmp[0][1]
    all_tables += "\n\n" + tmp

 * mysql+pymysql://root:***@localhost
6 rows affected.
 * mysql+pymysql://root:***@localhost
0 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

In [111]:
#
# If you want to see the schema printed as text, just uncomment the following and run.
#
print(all_tables)

CREATE TABLE `Appearances` (
  `yearID` bigint DEFAULT NULL,
  `teamID` text,
  `lgID` text,
  `playerID` text,
  `G_all` bigint DEFAULT NULL,
  `GS` double DEFAULT NULL,
  `G_batting` bigint DEFAULT NULL,
  `G_defense` double DEFAULT NULL,
  `G_p` bigint DEFAULT NULL,
  `G_c` bigint DEFAULT NULL,
  `G_1b` bigint DEFAULT NULL,
  `G_2b` bigint DEFAULT NULL,
  `G_3b` bigint DEFAULT NULL,
  `G_ss` bigint DEFAULT NULL,
  `G_lf` bigint DEFAULT NULL,
  `G_cf` bigint DEFAULT NULL,
  `G_rf` bigint DEFAULT NULL,
  `G_of` bigint DEFAULT NULL,
  `G_dh` double DEFAULT NULL,
  `G_ph` double DEFAULT NULL,
  `G_pr` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci

CREATE TABLE `Batting` (
  `playerID` text,
  `yearID` bigint DEFAULT NULL,
  `stint` bigint DEFAULT NULL,
  `teamID` text,
  `lgID` text,
  `G` bigint DEFAULT NULL,
  `AB` bigint DEFAULT NULL,
  `R` bigint DEFAULT NULL,
  `H` bigint DEFAULT NULL,
  `2B` bigint DEFAULT NULL,
  `3B` bigint DEFAULT NULL,
  `HR` bigint DEFAULT NULL,
  `RBI` double DEFAULT NULL,
  `SB` double DEFAULT NULL,
  `CS` double DEFAULT NULL,
  `BB` bigint DEFAULT NULL,
  `SO` double DEFAULT NULL,
  `IBB` double DEFAULT NULL,
  `HBP` double DEFAULT NULL,
  `SH` double DEFAULT NULL,
  `SF` double DEFAULT NULL,
  `GIDP` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci

CREATE TABLE `Managers` (
  `playerID` text,
  `yearID` bigint DEFAULT NULL,
  `teamID` text,
  `lgID` text,
  `inseason` bigint DEFAULT NULL,
  `G` bigint DEFAULT NULL,
  `W` bigint DEFAULT NULL,
  `L` bigint DEFAULT NULL,
  `rank` bigint DEFAULT NULL,
  `plyrMgr` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci

CREATE TABLE `people` (
  `playerID` varchar(20) NOT NULL,
  `birthYear` int DEFAULT NULL,
  `birthMonth` int DEFAULT NULL,
  `birthDay` int DEFAULT NULL,
  `birthCountry` varchar(50) DEFAULT NULL,
  `birthState` varchar(50) DEFAULT NULL,
  `birthCity` varchar(50) DEFAULT NULL,
  `deathYear` int DEFAULT NULL,
  `deathMonth` int DEFAULT NULL,
  `deathDay` int DEFAULT NULL,
  `deathCountry` varchar(50) DEFAULT NULL,
  `deathState` varchar(50) DEFAULT NULL,
  `deathCity` varchar(50) DEFAULT NULL,
  `nameFirst` varchar(50) DEFAULT NULL,
  `nameLast` varchar(50) NOT NULL,
  `nameGiven` varchar(100) DEFAULT NULL,
  `weight` int DEFAULT NULL,
  `height` int DEFAULT NULL,
  `bats` varchar(1) DEFAULT NULL,
  `throws` varchar(1) DEFAULT NULL,
  `debut` varchar(10) DEFAULT NULL,
  `finalGame` varchar(10) DEFAULT NULL,
  `retroID` varchar(20) DEFAULT NULL,
  `bbrefID` varchar(20) DEFAULT NULL,
  `dateOfBirth` date DEFAULT NULL,
  `dateOfDeath` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci

CREATE TABLE `Pitching` (
  `playerID` text,
  `yearID` bigint DEFAULT NULL,
  `stint` bigint DEFAULT NULL,
  `teamID` text,
  `lgID` text,
  `W` bigint DEFAULT NULL,
  `L` bigint DEFAULT NULL,
  `G` bigint DEFAULT NULL,
  `GS` bigint DEFAULT NULL,
  `CG` bigint DEFAULT NULL,
  `SHO` bigint DEFAULT NULL,
  `SV` bigint DEFAULT NULL,
  `IPouts` bigint DEFAULT NULL,
  `H` bigint DEFAULT NULL,
  `ER` bigint DEFAULT NULL,
  `HR` bigint DEFAULT NULL,
  `BB` bigint DEFAULT NULL,
  `SO` bigint DEFAULT NULL,
  `BAOpp` double DEFAULT NULL,
  `ERA` double DEFAULT NULL,
  `IBB` double DEFAULT NULL,
  `WP` bigint DEFAULT NULL,
  `HBP` double DEFAULT NULL,
  `BK` bigint DEFAULT NULL,
  `BFP` double DEFAULT NULL,
  `GF` bigint DEFAULT NULL,
  `R` bigint DEFAULT NULL,
  `SH` double DEFAULT NULL,
  `SF` double DEFAULT NULL,
  `GIDP` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci

CREATE TABLE `Teams` (
  `yearID` bigint DEFAULT NULL,
  `lgID` text,
  `teamID` text,
  `franchID` text,
  `divID` text,
  `Rank` bigint DEFAULT NULL,
  `G` bigint DEFAULT NULL,
  `Ghome` double DEFAULT NULL,
  `W` bigint DEFAULT NULL,
  `L` bigint DEFAULT NULL,
  `DivWin` text,
  `WCWin` text,
  `LgWin` text,
  `WSWin` text,
  `R` bigint DEFAULT NULL,
  `AB` bigint DEFAULT NULL,
  `H` bigint DEFAULT NULL,
  `2B` bigint DEFAULT NULL,
  `3B` bigint DEFAULT NULL,
  `HR` bigint DEFAULT NULL,
  `BB` double DEFAULT NULL,
  `SO` double DEFAULT NULL,
  `SB` double DEFAULT NULL,
  `CS` double DEFAULT NULL,
  `HBP` double DEFAULT NULL,
  `SF` double DEFAULT NULL,
  `RA` bigint DEFAULT NULL,
  `ER` bigint DEFAULT NULL,
  `ERA` double DEFAULT NULL,
  `CG` bigint DEFAULT NULL,
  `SHO` bigint DEFAULT NULL,
  `SV` bigint DEFAULT NULL,
  `IPouts` bigint DEFAULT NULL,
  `HA` bigint DEFAULT NULL,
  `HRA` bigint DEFAULT NULL,
  `BBA` bigint DEFAULT NULL,
  `SOA` bigint DEFAULT NULL,
  `E` bigint DEFAULT NULL,
  `DP` bigint DEFAULT NULL,
  `FP` double DEFAULT NULL,
  `name` text,
  `park` text,
  `attendance` double DEFAULT NULL,
  `BPF` bigint DEFAULT NULL,
  `PPF` bigint DEFAULT NULL,
  `teamIDBR` text,
  `teamIDlahman45` text,
  `teamIDretro` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci

## Schema and Data Cleanup

- There is a section below for each of the tables you created/loaded. 


- There is a set of instructions in each section.


- You are going to "clean up" the tables, primarily focusing on keys.


- A conceptual ER diagram for the schema is:

| <img src="./lahmans-conceptual.png" width="700px"> |
| :---: |
| __Conceptual ER Diagram__ |

### People

- The ```people``` table scheme is below.

```
create table People
(
    playerID     text   null,
    birthYear    double null,
    birthMonth   double null,
    birthDay     double null,
    birthCountry text   null,
    birthState   text   null,
    birthCity    text   null,
    deathYear    double null,
    deathMonth   double null,
    deathDay     double null,
    deathCountry text   null,
    deathState   text   null,
    deathCity    text   null,
    nameFirst    text   null,
    nameLast     text   null,
    nameGiven    text   null,
    weight       double null,
    height       double null,
    bats         text   null,
    throws       text   null,
    debut        text   null,
    finalGame    text   null,
    retroID      text   null,
    bbrefID      text   null
);
```

- You are to implement the following tasks:
    1. Determine reasonable lengths for ```text``` columns and convert the columns to ```varchar```.
    3. Convert the columns that are ```double``` to ```int```.
    2. Add columns ```dateOfBirth``` and ```dateOfDeath``` of type ```Date```. Set the values of the new columns based on the ```birthYear, birthMonth, birthDay, deathYear, deathMonth, deathDay``` column values.
    4. Change ```bats``` and ```throws``` to ```ENUM``` types.
    5. Convert the column type for ```debug``` and ```finalGame``` to date and set the values correctly.
    
    
- You implement the tasks changing the schema by executing ```ALTER TABLE``` statements.


- Changing or setting values usually requires you to execute ```UPDATE``` statements.


- You need to execute you statements in the cells below. You may add additional cells.

In [130]:
%%sql
ALTER TABLE people
MODIFY playerID varchar(20) not null,
MODIFY birthCountry varchar(50) null,
MODIFY birthState varchar(50) null,
MODIFY birthCity varchar(50) null,
MODIFY deathCountry varchar(50) null,
MODIFY deathState varchar(50) null,
MODIFY deathCity varchar(50) null,
MODIFY nameFirst varchar(50) null,
MODIFY nameLast varchar(50) not null,
MODIFY nameGiven varchar(100) null,
MODIFY bats varchar(1) null,
MODIFY throws varchar(1) null,
MODIFY debut varchar(10) null,
MODIFY finalGame varchar(10) null,
MODIFY retroID varchar(20) null,
MODIFY bbrefID varchar(20) null;

 * mysql+pymysql://root:***@localhost
20370 rows affected.

[]

In [134]:
%%sql
ALTER TABLE people
MODIFY birthYear int null,
MODIFY birthMonth int null,
MODIFY birthDay int null,
MODIFY deathYear int null,
MODIFY deathMonth int null,
MODIFY deathDay int null,
MODIFY weight int null,
MODIFY height int null;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [136]:
%%sql
ALTER TABLE people
ADD dateOfBirth date null,
ADD dateOfDeath date null;

UPDATE people
SET 
    dateOfBirth = date(CONCAT(birthYear,'-',birthMonth,'-',birthDay)),
    dateOfDeath = date(CONCAT(deathYear,'-',deathMonth,'-',deathDay))
WHERE 
    birthYear is not null and birthMonth is not null birthDay is not null
    deathYear is not null and deathMonth is not null and deathDay is not null;

 * mysql+pymysql://root:***@localhost
(pymysql.err.OperationalError) (1060, "Duplicate column name 'dateOfBirth'")
[SQL: ALTER TABLE people
ADD dateOfBirth date null,
ADD dateOfDeath date null;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [140]:
%%sql
ALTER TABLE people
MODIFY bats enum ('R', 'L', 'B') null,
MODIFY throws enum ('R', 'L', 'S') null;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [141]:
%%sql
ALTER TABLE people
MODIFY debut date null,
MODIFY finalGame date null;

 * mysql+pymysql://root:***@localhost
20370 rows affected.

[]

### Managers

- The schema for the managers table is

```
create table Managers
(
    playerID text   null,
    yearID   bigint null,
    teamID   text   null,
    lgID     text   null,
    inseason bigint null,
    G        bigint null,
    W        bigint null,
    L        bigint null,
    `rank`   bigint null,
    plyrMgr  text   null
);
```

- You are to implement the following tasks:
    - Convert ```playerID, teamID, lgID``` to ```varchar``` with reasonable sizes.
    - Convert ```yearID``` to ```char(4)```. I will explain why we are not using the data type ```Year```.
    - Convert ```plyrMgr``` to a ```BOOLEAN```. 
    
    
- Some of the tasks may require both ```ALTER TABLE``` and ```UPDATE```.

In [142]:
%%sql 
ALTER TABLE managers
MODIFY playerID VARCHAR(20),
MODIFY teamID VARCHAR(20),
MODIFY lgID VARCHAR(20);

 * mysql+pymysql://root:***@localhost
3684 rows affected.

[]

In [145]:
%%sql
ALTER TABLE Managers 
MODIFY yearID CHAR(4);

 * mysql+pymysql://root:***@localhost
3684 rows affected.

[]

In [149]:
%%sql
ALTER TABLE managers
MODIFY plyrMgr text not null;
UPDATE managers
SET
    plyrMgr = TRUE
WHERE
    plyrMgr = 'Y';
UPDATE managers
SET
    plyrMgr = FALSE
WHERE
    plyrMgr = 'N';
ALTER TABLE managers
MODIFY plyrMgr boolean not null;

 * mysql+pymysql://root:***@localhost
0 rows affected.
645 rows affected.
3039 rows affected.
3684 rows affected.

[]

### Appearances

- The schema for the appearances table is

```
create table Appearances
(
    yearID    bigint null,
    teamID    text   null,
    lgID      text   null,
    playerID  text   null,
    G_all     bigint null,
    GS        double null,
    G_batting bigint null,
    G_defense double null,
    G_p       bigint null,
    G_c       bigint null,
    G_1b      bigint null,
    G_2b      bigint null,
    G_3b      bigint null,
    G_ss      bigint null,
    G_lf      bigint null,
    G_cf      bigint null,
    G_rf      bigint null,
    G_of      bigint null,
    G_dh      double null,
    G_ph      double null,
    G_pr      double null
);
```

- Do not worry about the columns that are numeric (```double, bigint```).


- Tasks:
    - Convert ```yearID``` to ```char(4)```
    - Convert the ```text``` columns to reasonably sized ```varchar```.

In [151]:
%%sql
ALTER TABLE appearances
MODIFY yearID char(4) not null;

 * mysql+pymysql://root:***@localhost
110423 rows affected.

[]

In [152]:
%%sql
ALTER TABLE appearances
MODIFY teamID varchar(3) not null,
MODIFY lgID varchar(2) null,
MODIFY playerID varchar(10) not null;

 * mysql+pymysql://root:***@localhost
110423 rows affected.

[]

### Batting

- The Batting table is

```
create table Batting
(
    playerID text   null,
    yearID   bigint null,
    stint    bigint null,
    teamID   text   null,
    lgID     text   null,
    G        bigint null,
    AB       bigint null,
    R        bigint null,
    H        bigint null,
    `2B`     bigint null,
    `3B`     bigint null,
    HR       bigint null,
    RBI      double null,
    SB       double null,
    CS       double null,
    BB       bigint null,
    SO       double null,
    IBB      double null,
    HBP      double null,
    SH       double null,
    SF       double null,
    GIDP     double null
);
```

- You only need to fix the definitions ```playerID, teamID, yearID``` and ```lgID```.

In [155]:
%%sql
ALTER TABLE Batting 
MODIFY playerID VARCHAR(20),
MODIFY teamID VARCHAR(20),
MODIFY yearID CHAR(4),
MODIFY lgID VARCHAR(20);

 * mysql+pymysql://root:***@localhost
110495 rows affected.

[]

### Pitching

- The Pitching table is:

```
create table Pitching
(
    playerID text   null,
    yearID   bigint null,
    stint    bigint null,
    teamID   text   null,
    lgID     text   null,
    W        bigint null,
    L        bigint null,
    G        bigint null,
    GS       bigint null,
    CG       bigint null,
    SHO      bigint null,
    SV       bigint null,
    IPouts   bigint null,
    H        bigint null,
    ER       bigint null,
    HR       bigint null,
    BB       bigint null,
    SO       bigint null,
    BAOpp    double null,
    ERA      double null,
    IBB      double null,
    WP       bigint null,
    HBP      double null,
    BK       bigint null,
    BFP      double null,
    GF       bigint null,
    R        bigint null,
    SH       double null,
    SF       double null,
    GIDP     double null
);
```

- You only need to fix the definitions ```playerID, teamID, yearID``` and ```lgID```.

In [157]:
%%sql
ALTER TABLE pitching
MODIFY playerID varchar(10),
MODIFY teamID varchar(3),
MODIFY yearID char(4),
MODIFY lgID varchar(2);

 * mysql+pymysql://root:***@localhost
49430 rows affected.

[]

### Teams

- The Teams table is:

```
create table Teams
(
    yearID         bigint null,
    lgID           text   null,
    teamID         text   null,
    franchID       text   null,
    divID          text   null,
    `Rank`         bigint null,
    G              bigint null,
    Ghome          double null,
    W              bigint null,
    L              bigint null,
    DivWin         text   null,
    WCWin          text   null,
    LgWin          text   null,
    WSWin          text   null,
    R              bigint null,
    AB             bigint null,
    H              bigint null,
    `2B`           bigint null,
    `3B`           bigint null,
    HR             bigint null,
    BB             double null,
    SO             double null,
    SB             double null,
    CS             double null,
    HBP            double null,
    SF             double null,
    RA             bigint null,
    ER             bigint null,
    ERA            double null,
    CG             bigint null,
    SHO            bigint null,
    SV             bigint null,
    IPouts         bigint null,
    HA             bigint null,
    HRA            bigint null,
    BBA            bigint null,
    SOA            bigint null,
    E              bigint null,
    DP             bigint null,
    FP             double null,
    name           text   null,
    park           text   null,
    attendance     double null,
    BPF            bigint null,
    PPF            bigint null,
    teamIDBR       text   null,
    teamIDlahman45 text   null,
    teamIDretro    text   null
);
```

- You need to make the following changes:
    - Convert ```yearID, teamID, lgID, franchID, divId``` to reasonable types.
    - Convert ```DivWin, WCWin, LGWin, WSWin``` to ```boolean```.

In [159]:
%%sql
ALTER TABLE teams
MODIFY yearID char(4) not null,
MODIFY teamID varchar(3) not null,
MODIFY lgID varchar(2),
MODIFY franchID varchar(3) not null,
MODIFY divID varchar(1);

 * mysql+pymysql://root:***@localhost
2985 rows affected.

[]

In [160]:
%%sql
ALTER TABLE teams
MODIFY DivWin varchar(1),
MODIFY WCWin varchar(1),
MODIFY LGWin varchar(1),
MODIFY WSWin varchar(1);

UPDATE teams
SET
    DivWin = TRUE 
WHERE
    DivWin = 'Y';
UPDATE teams
SET
    DivWin = FALSE
WHERE
    DivWin = 'N';
UPDATE teams
SET
    WCWin = TRUE
WHERE
    WCWin = 'Y';
UPDATE teams
SET
    WCWin = FALSE
WHERE
    WCWin = 'N';
UPDATE teams
SET
    LGWin = TRUE
WHERE
    LGWin = 'Y';
UPDATE teams
SET
    LGWin = FALSE
WHERE
    LGWin = 'N';
UPDATE teams
SET
    WSWin = TRUE
WHERE
    WSWin = 'Y';
UPDATE teams
SET
    WSWin = FALSE
WHERE
    WSWin = 'N';
ALTER TABLE teams
MODIFY DivWin boolean,
MODIFY WCWin boolean,
MODIFY LGWin boolean,
MODIFY WSWin boolean;

 * mysql+pymysql://root:***@localhost
2985 rows affected.
266 rows affected.
1174 rows affected.
80 rows affected.
724 rows affected.
284 rows affected.
2673 rows affected.
122 rows affected.
2506 rows affected.
2985 rows affected.

[]

### Keys

#### Primary Keys

- In the following cells, write and SQL statements that demonstrates the combination of columns that is a valid primary key for each of the 6 tables.

In [162]:
%%sql
select
    playerID, yearID, teamID, count(*) as row_count
from
    appearances
group by
    playerID, yearID, teamID
order by
    row_count desc
limit 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('abercda01', '1871', 'TRO', 1),
 ('addybo01', '1871', 'RC1', 1),
 ('allisar01', '1871', 'CL1', 1),
 ('allisdo01', '1871', 'WS3', 1),
 ('ansonca01', '1871', 'RC1', 1)]

In [165]:
%%sql
select
    playerID, yearID, teamID
from
    appearances
where
    playerID is null or yearID is null or teamID is null;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [166]:
%%sql
select
    playerID, yearID, stint, count(*) as row_count 
from
    batting 
group by 
    playerID, yearID, stint
order by row_count desc
limit 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('abercda01', '1871', 1, 1),
 ('addybo01', '1871', 1, 1),
 ('allisar01', '1871', 1, 1),
 ('allisdo01', '1871', 1, 1),
 ('ansonca01', '1871', 1, 1)]

In [167]:
%%sql
select playerID, yearID, stint
from batting
where playerID is null or yearID is null or stint is null;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [169]:
%%sql
select playerID, yearID, inseason, count(*) as row_count 
from managers
group by playerID, yearID, inseason
order by row_count desc
limit 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('wrighha01', '1871', 1, 1),
 ('woodji01', '1871', 1, 1),
 ('paborch01', '1871', 1, 1),
 ('lennobi01', '1871', 1, 1),
 ('deaneha01', '1871', 2, 1)]

In [170]:
%%sql
select playerID, yearID, inseason
from managers
where playerID is null or yearID is null or inseason is null;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [172]:
%%sql
select yearID, teamID
from teams
where yearID is null or teamID is null;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [171]:
%%sql
select yearID, teamID, count(*) as row_count from teams
group by yearID, teamID
order by row_count desc
limit 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('1871', 'BS1', 1),
 ('1871', 'CH1', 1),
 ('1871', 'CL1', 1),
 ('1871', 'FW1', 1),
 ('1871', 'NY2', 1)]

In [173]:
%%sql
select playerID, yearID, stint
from pitching
where playerID is null or yearID is null or stint is null;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [174]:
%%sql
select playerID, yearID, stint, count(*) as row_count from pitching
group by playerID, yearID, stint
order by row_count desc
limit 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('bechtge01', '1871', 1, 1),
 ('brainas01', '1871', 1, 1),
 ('fergubo01', '1871', 1, 1),
 ('fishech01', '1871', 1, 1),
 ('fleetfr01', '1871', 1, 1)]

In [176]:
%%sql
select playerID from people where playerID is null;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [177]:
%%sql 
select playerID, count(*) as row_count from people group by playerID order by row_count desc
limit 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('aardsda01', 1),
 ('aaronha01', 1),
 ('aaronto01', 1),
 ('aasedo01', 1),
 ('abadan01', 1)]

- Write and execute SQL ```ALTER TABLE``` staments to add the primary keys to the tables.

In [178]:
%%sql 
ALTER TABLE teams
ADD CONSTRAINT teams_pk PRIMARY KEY (yearID, teamID);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [180]:
%%sql 
ALTER TABLE pitching
ADD CONSTRAINT pitching_pk PRIMARY KEY (playerID, yearID, stint);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [179]:
%%sql 
ALTER TABLE managers
ADD CONSTRAINT managers_pk PRIMARY KEY (playerID, yearID, inseason);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [181]:
%%sql 
ALTER TABLE batting
ADD CONSTRAINT batting_pk PRIMARY KEY (playerID, yearID, stint);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [182]:
%%sql 
ALTER TABLE people
ADD CONSTRAINT people_pk PRIMARY KEY (playerID);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [183]:
%%sql 
ALTER TABLE appearances
ADD CONSTRAINT appearances_pk PRIMARY KEY (playerID, yearID, teamID);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

- You will need to write queries that determine which columns form the foreign keys in the relationships. Write and execute your queries below.

In [198]:
%%sql
SELECT *FROM managers
where not exists(select *
    from teams where
        managers.yearID = teams.yearID and
        managers.teamID = teams.teamID    );
SELECT *FROM managers 
where not exists(select * from people where managers.playerID = people.playerID);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [200]:
%%sql
select *from appearances
where not exists(select *
    from teams where appearances.yearID = teams.yearID and appearances.teamID = teams.teamID);
DELETE FROM appearances WHERE playerID = 'thompan01';
select *from appearances
where not exists(select *from people where appearances.playerID = people.playerID);

 * mysql+pymysql://root:***@localhost
0 rows affected.
1 rows affected.
0 rows affected.

[]

In [199]:
%%sql
DELETE FROM batting WHERE playerID = 'smithbu01' and yearID = '1911' and stint = 1;
DELETE FROM batting WHERE playerID = 'thompfr01' and yearID = '1875' and stint = 2;
select *from batting
where not exists(select *
    from appearances where
        batting.playerID = appearances.playerID and
        batting.yearID = appearances.yearID and
        batting.teamID = appearances.teamID);
select *from batting
where not exists(select *
    from people where batting.playerID = people.playerID);
select *from batting
where not exists(select *
    from teams where
        batting.yearID = teams.yearID and batting.teamID = teams.teamID);

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [212]:
%%sql
select *from pitching
where not exists(select *
    from appearances where
        pitching.playerID = appearances.playerID and
        pitching.yearID = appearances.yearID and
        pitching.teamID = appearances.teamID);
select *from pitching
where not exists(select * from people where pitching.playerID = people.playerID);
select *from pitching
where not exists(select * from teams where pitching.yearID = teams.yearID and pitching.teamID = teams.teamID);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.

[]

- Write and execute the ```ALTER TABLE``` statements to create the foreign keys.


- __NOTE:__ There may be some minor issues with missing or incorrect data. You can delete a few rows if necessary.

In [201]:
%%sql
ALTER TABLE appearances
ADD CONSTRAINT appearances_teams_fk FOREIGN KEY (yearID, teamID) references teams(yearID, teamID),
ADD CONSTRAINT appearances_people_fk FOREIGN KEY (playerID) references people(playerID);

 * mysql+pymysql://root:***@localhost
110422 rows affected.

[]

In [206]:
%%sql
ALTER TABLE batting
ADD CONSTRAINT batting_appearances_fk FOREIGN KEY (playerID, yearID, teamID) references appearances(playerID, yearID, teamID),
ADD CONSTRAINT batting_people_fk FOREIGN KEY (playerID) references people(playerID),
ADD CONSTRAINT batting_teams_fk FOREIGN KEY (yearID, teamID) references teams(yearID, teamID);

 * mysql+pymysql://root:***@localhost
110493 rows affected.

[]

In [186]:
%%sql
ALTER TABLE managers
ADD CONSTRAINT managers_teams_fk FOREIGN KEY (yearID, teamID) references teams(yearID, teamID),
ADD CONSTRAINT managers_people_fk FOREIGN KEY (playerID) references people(playerID);

 * mysql+pymysql://root:***@localhost
3684 rows affected.

[]

In [213]:
%%sql
ALTER TABLE pitching
ADD CONSTRAINT pitching_appearances_fk FOREIGN KEY (playerID, yearID, teamID) references appearances(playerID, yearID, teamID),
ADD CONSTRAINT pitching_people_fk FOREIGN KEY (playerID) references people(playerID),
ADD CONSTRAINT pitching_teams_fk FOREIGN KEY (yearID, teamID) references teams(yearID, teamID);

 * mysql+pymysql://root:***@localhost
(pymysql.err.OperationalError) (1826, "Duplicate foreign key constraint name 'pitching_appearances_fk'")
[SQL: ALTER TABLE pitching
ADD CONSTRAINT pitching_appearances_fk FOREIGN KEY (playerID, yearID, teamID) references appearances(playerID, yearID, teamID),
ADD CONSTRAINT pitching_people_fk FOREIGN KEY (playerID) references people(playerID),
ADD CONSTRAINT pitching_teams_fk FOREIGN KEY (yearID, teamID) references teams(yearID, teamID);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## SQL Queries

### On-Base Percentage and Slugging

- Use the ```Batting``` table and ```People``` table.


- The formula for ```onBasePercentage``` is:
\begin{equation}
\frac{(H - 2b - 3b - HR) + 2 \times 2b + 3 \times 3b + 4 \times HR)}{AB}
\end{equation}


- Write a query that returns a table of the form
```
(playerID, nameLast, nameFirst, h, ab, G, onBasePercentage)
```

- Test your query with ```playerID``` ```willite01```.

In [164]:
%%sql
SELECT b.playerID, p.nameLast, p.nameFirst, SUM(b.H) AS h, SUM(b.AB) AS ab, SUM(b.G) AS G,
((SUM(b.H) - SUM(b.`2B`) - SUM(b.`3B`) - SUM(b.HR)) + (2 * SUM(b.`2B`)) + (3 * SUM(b.`3B`)) + (4 * SUM(b.HR))) / SUM(b.AB) AS onBasePercentage
FROM Batting b
JOIN People p ON b.playerID = p.playerID
GROUP BY b.playerID, p.nameLast, p.nameFirst
HAVING b.playerID = 'willite01';

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('willite01', 'Williams', 'Ted', Decimal('2654'), Decimal('7706'), Decimal('2292'), Decimal('0.6338'))]

### Players and Managers

- A person in ```People``` was a "player" if their ```playerID``` appears in ```Appearances.```


- A person in ```People``` was a "manager" if their ```playerID``` appears in ```Managers.```


- Write a query that returns a table of the form
```
(playerID, nameLast, nameFirst, career_player_games, career_manager_games)
```

- ```career_player_games``` is the sum of ```Appearances.G_all```. The value should be ```0``` if the person was never a player.


- ```career_manager_games``` is the sum of ```Managers.G```. The value should be ```0``` if the person was never a manager.


- Test your query with players born in California with ```nameLast``` "Williams."

In [163]:
%%sql
with
    player_stats as(        
        select
            playerID,            
        Sum(G_all) as career_player_games        
        from appearances        
        group by playerID),    
    manager_stats as(        
        select
            playerID,            
            Sum(G) as career_manager_games        
        from managers        
        group by playerID)
select
    playerID, nameLast, nameFirst, career_player_games, career_manager_games
from
    player_stats join manager_stats using(playerID) join people using(PlayerID)
where
    birthState = 'CA' and
    nameLast = 'Williams';

 * mysql+pymysql://root:***@localhost
3 rows affected.

[('williji03', 'Williams', 'Jimy', Decimal('14'), Decimal('1700')),
 ('willima04', 'Williams', 'Matt', Decimal('1866'), Decimal('324')),
 ('willite01', 'Williams', 'Ted', Decimal('2292'), Decimal('637'))]